Repository: sn0rkmaiden/turtle_math
Catalog: lib/l10n/app_*.arb
Languages: ru

# language
source: English
ru: Русский

source: RUN
ru: ЗАПУСК

# page1latex
source: <h3>This app allows to visualize both real and complex roots of 2nd and 3rd degree algebraic equations using right-angle geometric paths</h3>
ru: Визуализируйте действительные и комплексные решения уравнений второй и третьей степени с помощью метода Лиля.

# page2latex
source: <h4>Coefficients are expressed in straight lines forming a geometric path (black line) where each coefficient is positioned at right angles to the previous, progressively counter-clockwise.</h4>
ru: Коэффициенты изображаются в виде прямых линий (черная линия), где каждый коэффициент расположен под прямым углом к ​​предыдущему, последовательно против часовой стрелки.

# page2text
source: Red line provides real solutions if it intersects the <h4>b-line</h4> with negative solutions to the left and positive to the right relative to <h4>a-line</h4>
ru: Красная линия дает действительные решения, если она пересекает <h4>сегмент b</h4> с отрицательными решениями слева и положительными справа относительно <h4>сегмента a.</h4>

# page6latex
source: <h4>$$Background$$<h4> Equations of odd degree always have one real solution. Equations of even degree may have no real solution. But, if there are, they will occur in pairs.
ru: <h3>$$Некоторые \, сведения $$</h3> Уравнения нечетной степени всегда имеют одно действительное решение. Уравнения четной степени могут не иметь действительного решения. Но если они есть, то будут встречаться парами.

# page6text
source: <h4>Any algebraic equation can be divided by its first coefficient. So segment corresponding to the first coefficient will be draw vertically up and be 1 unit long by default.</h4>
ru: <h4>Любое уравнение можно разделить на его первый коэффициент. Поэтому отрезок, соответствующий первому коэффициенту, будет по умолчанию иметь длину 1.</h4>

# page3latex
source: Real part of complex solution is <h4>(-b / 2).</h4> Complex parts are intersections of yellow circle with <h4>(x = -b/2).</h4> Yellow circle is built on points of intersection of blue circle (which has diameter of (a + c)) with <h4>b-line.</h4>
ru: Действительная часть комплексного решения равна <h4>(-b / 2).</h4> Комплексные части являются пересечениями желтого круга с прямой <h4>(x = -b / 2).</h4> Желтый круг построен на точках пересечения синего круга (диаметр которого равен (a + c)) с <h4>сегментом b.</h4>

# page7latex
source: In cubic equations solution paths can be treated as quadratic equation's coefficients and are used to find 2 complex roots if they exist when one real is discovered.
ru: Траекторию решения кубического уравнения можно рассматривать как траекторию, соответствующую квадратному уравнению, и использовать для нахождения двух комплексных корней, если они существуют, после обнаружении одного действительного корня.

# page4latex
source: <h4>Want to learn more? Here is a list of useful resources!</h4>
ru: Хотите разобраться подробнее? Список использованных ресурсов:

# page5latex
source: Real solutions are intersections of a circle constructed between start and end points and <h4>b-line.</h4>
ru: Действительные решения представляют собой пересечения круга, построенного между начальной и конечной точками, и <h4>сегмента b.</h4>

# coefficients
source: Type coefficients of cubic equation
ru: Введите коэффициенты уравнения

# startButton
source: Start drawing the path!
ru: Построить траекторию!

# xPoint
source: You choose the point by changing the angle of the laser
ru: Точка меняется при изменении наклона угла луча

# pOfX
source: Polynomial evaluated at the point X. Look for this value to get as close to zero as possible!
ru: Значение полинома в точке X. Постарайтесь сделать это значение как можно ближе к нулю!

# error
source: You should type in all the coefficients first!
ru: Сначала нужно ввести все коэффициенты!

# congrats
source: Congratulations! You have found a root: x =
ru: Ура! Вы нашли корень: x =

# allRoots
source: Yahoo! You have found all the real roots!
ru: Отлично! Вы нашли все вещественные корни многочлена!

# numRoots
source: Number of found roots:
ru: Количество найденных корней:

# rootsDescription
source: Track number of roots that you have found!
ru: Отслеживайте, сколько корней еще нужно найти!

# drawing
source: Use ONE finger to control light beam and TWO fingers to move it around! To scale image double tap on right / left half of the screen.
ru: Используйте ОДИН палец, чтобы управлять углом наклона луча и ДВА пальца, чтобы перемещать его по экрану! Для изменения масштаба используйсте двойное нажатие на левую / правую половину экрана.

# hasComplexRoots
source: Be careful! This equation has complex roots.
ru: Осторожно! Среди решений уравнения есть комплексные.

# linkArticle
source: Extending Lill's method of 1867' by Phillips Verner Bradford
ru: Статья 'Extending Lill's method of 1867' от P.V. Bradford

# linkVideo
source: Mathologer video
ru: Видео с канала 'Mathologer'

# linkWebsite
source: Cool website with more links
ru: Веб-страница с дополнительными материалами по теме
